@AdamTylerLynch see new test. parameter not setting correctly from `list-instance-attributes`. the test intends to flip all attributes 1 direction then the other to validate update works on all attrs.

```
make testacc TESTARGS='-run=TestAccAwsConnectInstance_custom'
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./aws -v -count 1 -parallel 20 -run=TestAccAwsConnectInstance_custom -timeout 180m
=== RUN   TestAccAwsConnectInstance_custom
=== PAUSE TestAccAwsConnectInstance_custom
=== CONT  TestAccAwsConnectInstance_custom
    resource_aws_connect_instance_test.go:112: Step 1/3 error: Check failed: Check 9/14 error: aws_connect_instance.test: Attribute 'contact_lens_enabled' expected "false", got "true"
--- FAIL: TestAccAwsConnectInstance_custom (77.74s)
FAIL
FAIL	github.com/terraform-providers/terraform-provider-aws/aws	80.978s
FAIL
make: *** [testacc] Error 1
```

verified using native terraform also:

```
resource "aws_connect_instance" "test" {
  instance_alias = "test-drew12341234"
  provider = connect

  identity_management_type = "CONNECT_MANAGED"
  inbound_calls_enabled    = true
  outbound_calls_enabled   = true
  contact_lens_enabled     = false
}
```

```
$ tf apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_connect_instance.test will be created
  + resource "aws_connect_instance" "test" {
      + arn                              = (known after apply)
      + auto_resolve_best_voices_enabled = true
      + contact_flow_logs_enabled        = false
      + contact_lens_enabled             = false
      + created_time                     = (known after apply)
      + early_media_enabled              = true
      + id                               = (known after apply)
      + identity_management_type         = "CONNECT_MANAGED"
      + inbound_calls_enabled            = true
      + instance_alias                   = "test-drew12341234"
      + outbound_calls_enabled           = true
      + service_role                     = (known after apply)
      + status                           = (known after apply)
      + use_custom_tts_voices_enabled    = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_connect_instance.test: Creating...
aws_connect_instance.test: Still creating... [10s elapsed]
aws_connect_instance.test: Still creating... [20s elapsed]
aws_connect_instance.test: Still creating... [30s elapsed]
aws_connect_instance.test: Still creating... [40s elapsed]
aws_connect_instance.test: Still creating... [50s elapsed]
aws_connect_instance.test: Still creating... [1m0s elapsed]
aws_connect_instance.test: Creation complete after 1m8s [id=378c871d-6fdd-4553-bd50-9d4bf7eb3b2d]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ tf apply
aws_connect_instance.test: Refreshing state... [id=378c871d-6fdd-4553-bd50-9d4bf7eb3b2d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_connect_instance.test will be updated in-place
  ~ resource "aws_connect_instance" "test" {
      ~ contact_lens_enabled             = true -> false
        id                               = "378c871d-6fdd-4553-bd50-9d4bf7eb3b2d"
        # (12 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

what the actual instance shows:

```
$ aws connect list-instance-attributes --instance-id "378c871d-6fdd-4553-bd50-9d4bf7eb3b2d"
{
    "Attributes": [
        {
            "AttributeType": "AUTO_RESOLVE_BEST_VOICES",
            "Value": "true"
        },
        {
            "AttributeType": "CONTACTFLOW_LOGS",
            "Value": "false"
        },
        {
            "AttributeType": "CONTACT_LENS",
            "Value": "true"
        },
        {
            "AttributeType": "EARLY_MEDIA",
            "Value": "true"
        },
        {
            "AttributeType": "INBOUND_CALLS",
            "Value": "true"
        },
        {
            "AttributeType": "OUTBOUND_CALLS",
            "Value": "true"
        },
        {
            "AttributeType": "USE_CUSTOM_TTS_VOICES",
            "Value": "false"
        }
    ]
}
```